In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df['FlightNumber'].isnull()

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

### Replace the missing values in the Flight Number

In [5]:
df.FlightNumber=range(10045,10095,10)
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

### So here we can see the missing values have been replaced

###  Now  we have to split the from to column and make it into a new temporary dataframe

In [6]:
pf=pd.DataFrame()
pf[['From','To']]=df['From_To'].str.split('_',expand=True)
pf

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

### We have to make the string of from and to gramatically correct

In [7]:
df['From_To'].str.capitalize()

0        London_paris
1        Madrid_milan
2    London_stockholm
3      Budapest_paris
4     Brussels_london
Name: From_To, dtype: object

### Delete the From_To column and attach the temporary dataframe from the previous questions

In [8]:
df.drop('From_To',axis=1,inplace=True)

In [9]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [10]:
df=pd.concat([df,pf],axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [11]:
df['From']=df['From'].str.capitalize()
df['To']=df['To'].str.capitalize()
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

### In the recent delays column the values have been entered into the dataframe as a list.We would like each first value in its own columns each second value in its own column,if there isnot nth value no value should be Nan.

### Expand the series of lists into a dataframe named delays ,rename the columns delay 1,delay 2,...etc, and replace the unwanted recent delays column in df with delays

In [12]:
def get_RecentDelays(l,i):
    try:
        return l[i]
    except:
        return np.nan

In [13]:
df["delay_1"]=df.RecentDelays.apply(lambda x:get_RecentDelays(x,0))
df["delay_2"]=df.RecentDelays.apply(lambda x:get_RecentDelays(x,1))
df["delay_3"]=df.RecentDelays.apply(lambda x:get_RecentDelays(x,2))
df.drop("RecentDelays",axis=1,inplace=True)

In [15]:
import re
df.Airline=df.Airline.apply(lambda x:re.sub("[^a-zA-z]","",x))
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,AirFrance,Madrid,Milan,NaN,NaN,NaN
2,10065,BritishAirways,London,Stockholm,24.0,43.0,87.0
3,10075,AirFrance,Budapest,Paris,13.0,NaN,NaN
4,10085,SwissAir,Brussels,London,67.0,32.0,NaN